word = input()
x = ('а', 'е', 'и', 'о', 'у', 'ё', 'ю', 'я', 'ы', 'э', 'А', 'Е', 'И', 'О', 'У', 'Ё', 'Ю', 'Я', 'Ы', 'Э')
y = ('б', 'в', 'г', 'д', 'ж', 'з', 'й', 'к', 'л', 'м', 'н', 'п', 'р', 'с', 'т', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ь', 'Б', 'В', 'Г', 'Д', 'Ж', 'З', 'Й', 'К', 'Л', 'М', 'Н', 'П', 'Р', 'С', 'Т', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ь')
wlen = len(word)
a = 0
b = 0
c = 0
for i in word:
    for j in x:
        if j in i:
            a += 1
for i in word:
    for j in y:
        if j in i:
            b += 1
c = a/b
d = round(c, 3)
d = d * 100
print('Кол-во символов:', wlen)
print('Кол-во гласных:', a)
print('Кол-во согласных:', b)
print('гл/согл:', d, '%')
